deploy: p-hermes full package update
